[M_Skagzilla2_Adult MissionDefinition]
MissionDescription="After healing the hungry skag's wounds, you discovered he was starving as well. Maybe you could fill his belly with some chow."

[M_Skagzilla2_Den MissionDefinition]
MissionDescription="Now that the hungry skag has been properly fed, he's too big to fit in his old home. You'll have to escort him to the nearby cave, where he can have the space he needs."

[M_Skagzilla2_Den:ClearOutCave MissionObjectiveDefinition]
ProgressMessage="Clear out mine"
